In [8]:
import pandas as pd
import numpy as np

In [9]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randn(5),
'data2' : np.random.randn(5)})

In [10]:
df

  key1 key2     data1     data2
0    a  one -0.592780 -0.160733
1    a  two  0.578032  0.060901
2    b  one -0.778932 -0.615507
3    b  two  1.041091 -1.357447
4    a  one  0.600330  2.129708

In [11]:
grouped = df['data1'].groupby(df['key1'])

In [12]:
grouped

In [13]:
grouped.mean()

key1
a    0.195194
b    0.131080
Name: data1, dtype: float64

In [14]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [15]:
means

key1  key2
a     one     0.003775
      two     0.578032
b     one    -0.778932
      two     1.041091
Name: data1, dtype: float64

In [16]:
means.unstack()

key2       one       two
key1
a     0.003775  0.578032
b    -0.778932  1.041091

In [17]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [18]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [19]:
df['data1'].groupby([states, years]).mean()

California  2005    0.578032
            2006   -0.778932
Ohio        2005    0.224155
            2006    0.600330
Name: data1, dtype: float64

In [20]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.195194  0.676625
b     0.131080 -0.986477

In [21]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.003775  0.984487
     two   0.578032  0.060901
b    one  -0.778932 -0.615507
     two   1.041091 -1.357447

In [22]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [23]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.592780 -0.160733
1    a  two  0.578032  0.060901
4    a  one  0.600330  2.129708
b
  key1 key2     data1     data2
2    b  one -0.778932 -0.615507
3    b  two  1.041091 -1.357447

In [24]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print( k1, k2)
    print( group)

a one
  key1 key2    data1     data2
0    a  one -0.59278 -0.160733
4    a  one  0.60033  2.129708
a two
  key1 key2     data1     data2
1    a  two  0.578032  0.060901
b one
  key1 key2     data1     data2
2    b  one -0.778932 -0.615507
b two
  key1 key2     data1     data2
3    b  two  1.041091 -1.357447

In [25]:
pieces = dict(list(df.groupby('key1')))

In [26]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.778932 -0.615507
3    b  two  1.041091 -1.357447

In [27]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [28]:
grouped = df.groupby(df.dtypes, axis=1)

In [29]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.592780 -0.160733
1  0.578032  0.060901
2 -0.778932 -0.615507
3  1.041091 -1.357447
4  0.600330  2.129708
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [30]:
people = pd.DataFrame(np.random.randn(5, 5),
columns=['a', 'b', 'c', 'd', 'e'],
index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [31]:
people.iloc[2:3, ['b', 'c']] = np.nan

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices

In [ ]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [ ]:
by_column = people.groupby(mapping, axis=1)

In [ ]:
by_column.sum()

In [ ]:
map_series = pd.Series(mapping)

In [ ]:
map_series

In [ ]:
people.groupby(map_series, axis=1).count()

In [ ]:
people.groupby(len).sum()

In [32]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [33]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -1.438801 -0.334390 -2.105475 -0.286183 -0.017100
  two  0.458331  1.174698  1.044580 -0.934787 -2.063513
5 one  0.180949 -1.173024  0.683122  0.695749 -1.113584
6 two  0.055787 -1.662435 -0.001330  0.659653 -1.590980

In [34]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
[1, 3, 5, 1, 3]], names=['cty', 'tenor'])

In [35]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [36]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -1.114303 -0.137449  0.795861 -0.865744 -2.054120
1     -1.084691  0.378840 -0.103633  0.767395 -0.662203
2      0.953761 -2.228614 -0.160265 -0.080167  0.164876
3      0.576873  1.623746  0.134068 -1.004408  0.980550

In [37]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [38]:
df

  key1 key2     data1     data2
0    a  one -0.592780 -0.160733
1    a  two  0.578032  0.060901
2    b  one -0.778932 -0.615507
3    b  two  1.041091 -1.357447
4    a  one  0.600330  2.129708

In [39]:
grouped = df.groupby('key1')

In [40]:
grouped['data1'].quantile(0.9)

key1
a    0.595870
b    0.859089
Name: data1, dtype: float64

In [41]:
def peak_to_peak(arr):
    return arr.max()- arr.min()

In [42]:
grouped.agg(peak_to_peak)

/usr/lib/python3/dist-packages/pandas/core/groupby/generic.py:303: FutureWarning: Dropping invalid columns in SeriesGroupBy.agg is deprecated. In a future version, a TypeError will be raised. Before calling .agg, select only columns which should be valid for the aggregating function.
  results[key] = self.aggregate(func)

         data1     data2
key1
a     1.193110  2.290441
b     1.820023  0.741941

In [43]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.195194  0.682497 -0.592780 -0.007374  0.578032  0.589181
b      2.0  0.131080  1.286951 -0.778932 -0.323926  0.131080  0.586085

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.600330   3.0  0.676625  1.263276 -0.160733 -0.049916  0.060901
b     1.041091   2.0 -0.986477  0.524631 -1.357447 -1.171962 -0.986477


           75%       max
key1
a     1.095305  2.129708
b    -0.800992 -0.615507

In [44]:
tips = pd.read_csv('examples/tips.csv')

In [45]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [46]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [47]:
grouped = tips.groupby(['day', 'smoker'])

In [48]:
grouped_pct = grouped['tip_pct']

In [49]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [50]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [51]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [52]:
functions = ['count', 'mean', 'max']

In [53]:
result = grouped['tip_pct', 'total_bill'].agg(functions)

/tmp/ipykernel_3468/1540724723.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  result = grouped['tip_pct', 'total_bill'].agg(functions)

In [54]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [55]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [56]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [57]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

/tmp/ipykernel_3468/514018043.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  grouped['tip_pct', 'total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [58]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [59]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],
'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [60]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [61]:
def top(df, n=5, column='tip_pct'):
    return df.sort_index()[-n:]

In [62]:
top(tips, n=6)

     total_bill   tip smoker   day    time  size   tip_pct
238       35.83  4.67     No   Sat  Dinner     3  0.130338
239       29.03  5.92     No   Sat  Dinner     3  0.203927
240       27.18  2.00    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75     No   Sat  Dinner     2  0.098204
243       18.78  3.00     No  Thur  Dinner     2  0.159744

In [63]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     235       10.07  1.25     No   Sat  Dinner     2  0.124131
       238       35.83  4.67     No   Sat  Dinner     3  0.130338
       239       29.03  5.92     No   Sat  Dinner     3  0.203927
       242       17.82  1.75     No   Sat  Dinner     2  0.098204
       243       18.78  3.00     No  Thur  Dinner     2  0.159744
Yes    234       15.53  3.00    Yes   Sat  Dinner     2  0.193175
       236       12.60  1.00    Yes   Sat  Dinner     2  0.079365
       237       32.83  1.17    Yes   Sat  Dinner     2  0.035638
       240       27.18  2.00    Yes   Sat  Dinner     2  0.073584
       241       22.67  2.00    Yes   Sat  Dinner     2  0.088222

In [64]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill   tip smoker   day    time  size   tip_pct
smoker day
No     Fri  223       15.98  3.00     No   Fri   Lunch     3  0.187735
       Sat  242       17.82  1.75     No   Sat  Dinner     2  0.098204
       Sun  185       20.69  5.00     No   Sun  Dinner     5  0.241663
       Thur 243       18.78  3.00     No  Thur  Dinner     2  0.159744
Yes    Fri  226       10.09  2.00    Yes   Fri   Lunch     2  0.198216
       Sat  241       22.67  2.00    Yes   Sat  Dinner     2  0.088222
       Sun  190       15.69  1.50    Yes   Sun  Dinner     2  0.095602
       Thur 205       16.47  3.23    Yes  Thur   Lunch     3  0.196114

In [65]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [66]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [67]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [68]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
235       10.07  1.25     No   Sat  Dinner     2  0.124131
238       35.83  4.67     No   Sat  Dinner     3  0.130338
239       29.03  5.92     No   Sat  Dinner     3  0.203927
242       17.82  1.75     No   Sat  Dinner     2  0.098204
243       18.78  3.00     No  Thur  Dinner     2  0.159744
234       15.53  3.00    Yes   Sat  Dinner     2  0.193175
236       12.60  1.00    Yes   Sat  Dinner     2  0.079365
237       32.83  1.17    Yes   Sat  Dinner     2  0.035638
240       27.18  2.00    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Yes   Sat  Dinner     2  0.088222

In [69]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
'data2': np.random.randn(1000)})

In [70]:
quartiles = pd.cut(frame.data1, 4)

In [71]:
quartiles[:10]

0       (-0.432, 1.3]
1       (-0.432, 1.3]
2       (-0.432, 1.3]
3    (-2.163, -0.432]
4    (-2.163, -0.432]
5    (-2.163, -0.432]
6        (1.3, 3.032]
7       (-0.432, 1.3]
8       (-0.432, 1.3]
9    (-2.163, -0.432]
Name: data1, dtype: category
Categories (4, interval[float64, right]): [(-3.902, -2.163] < (-2.163, -0.432] < (-0.432, 1.3] < (1.3, 3.032]]

In [72]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
    'count': group.count(), 'mean': group.mean()}

In [73]:
grouped = frame.data2.groupby(factor)

NameError: name 'factor' is not defined

In [74]:
grouped.apply(get_stats).unstack()

/tmp/ipykernel_3468/867895773.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  'count': group.count(), 'mean': group.mean()}

smoker,No,Yes
day,,
Fri,"{'min': [12.46, 1.5, 'No', 'Fri', 'Dinner', 2,...","{'min': [5.75, 1.0, 'Yes', 'Fri', 'Dinner', 1,..."
Sat,"{'min': [7.25, 1.0, 'No', 'Sat', 'Dinner', 1, ...","{'min': [3.07, 1.0, 'Yes', 'Sat', 'Dinner', 1,..."
Sun,"{'min': [8.77, 1.01, 'No', 'Sun', 'Dinner', 2,...","{'min': [7.25, 1.5, 'Yes', 'Sun', 'Dinner', 2,..."
Thur,"{'min': [7.51, 1.25, 'No', 'Thur', 'Dinner', 1...","{'min': [10.34, 2.0, 'Yes', 'Thur', 'Lunch', 2..."

In [75]:
grouping = pd.qcut(frame.data1, 10, labels=False)

In [76]:
grouped = frame.data2.groupby(grouping)

In [77]:
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -2.989159  2.996943  100.0 -0.036060
1     -2.960885  2.742266  100.0  0.167630
2     -1.940347  2.569493  100.0  0.120551
3     -2.486887  3.869415  100.0 -0.104360
4     -2.098685  2.357995  100.0  0.105892
5     -2.611806  2.937185  100.0 -0.036383
6     -2.532822  2.104963  100.0 -0.125864
7     -3.206000  2.932813  100.0 -0.054965
8     -2.097874  2.603769  100.0  0.074057
9     -2.329492  2.388060  100.0 -0.078372

In [80]:
from datetime import datetime

In [81]:
now = datetime.now()

In [82]:
now

datetime.datetime(2022, 10, 24, 19, 16, 25, 711832)

In [83]:
now.year, now.month, now.day

(2022, 10, 24)

In [85]:
delta = datetime(2011, 1, 7) - datetime(2008, 6, 24, 8, 15)

In [86]:
delta

datetime.timedelta(days=926, seconds=56700)

In [87]:
delta.days

926

In [88]:
delta.seconds

56700

In [89]:
from datetime import timedelta

In [90]:
start = datetime(2011, 1, 7)

In [91]:
start + timedelta(12)

datetime.datetime(2011, 1, 19, 0, 0)

In [92]:
start - 2 * timedelta(12)

datetime.datetime(2010, 12, 14, 0, 0)

In [94]:
stamp = datetime(2011, 1, 3)

In [95]:
str(stamp)

'2011-01-03 00:00:00'

In [96]:
stamp.strftime('%Y–%m–%d')

'2011–01–03'

In [97]:
value = '2011–01–03'

In [98]:
datetime.strptime(value, '%Y–%m–%d')

datetime.datetime(2011, 1, 3, 0, 0)

In [99]:
datestrs = ['7/6/2011', '8/6/2011']

In [100]:
[datetime.strptime(x, '%m/%d/%Y') for x in datestrs]

[datetime.datetime(2011, 7, 6, 0, 0), datetime.datetime(2011, 8, 6, 0, 0)]

In [101]:
from dateutil.parser import parse

In [103]:
parse('2011-01-03')

datetime.datetime(2011, 1, 3, 0, 0)

In [104]:
parse('Jan 31, 1997 10:45 PM')

datetime.datetime(1997, 1, 31, 22, 45)

In [105]:
parse('6/12/2011', dayfirst=True)

datetime.datetime(2011, 12, 6, 0, 0)

In [106]:
datestrs = ['2011-07-06 12:00:00', '2011-08-06 00:00:00']

In [107]:
pd.to_datetime(datestrs)

DatetimeIndex(['2011-07-06 12:00:00', '2011-08-06 00:00:00'], dtype='datetime64[ns]', freq=None)

In [108]:
idx = pd.to_datetime(datestrs + [None])

In [109]:
idx

DatetimeIndex(['2011-07-06 12:00:00', '2011-08-06 00:00:00', 'NaT'], dtype='datetime64[ns]', freq=None)

In [111]:
idx[2]

NaT

In [112]:
pd.isnull(idx)

array([False, False,  True])